# Задача 18:
# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai.
# Последняя строка содержит число X
#
# Проверка:
# 5
# 12345
# 6
# -> 5
#
# Примечание:
# Для решения задачи, массив заполняем вручную

# Решение:
n = int(input("Введите количество элементов в массиве: "))
list_1 = []
for i in range(n):
    list_1.append(int(input("Введите элемент массива: "))) # подумал, что так интереснее решать задачу: мы сами создаем элементы массива
x = int(input("Введите число X: "))
min_diff = abs(list_1[0] - x) # функция модуля (можно через условие и проверки, но так проще)
closest = list_1[0]
for i in range(1, n):
    diff = abs(list_1[i] - x)
    if diff < min_diff:
        min_diff = diff
        closest = list_1[i]
print("Самый близкий по величине элемент к числу X:", closest)
