# Задача № 16:
# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai.
# Последняя строка содержит число X
#
# Проверка:
# 5
# 1234
# 5
# 3
# -> 1
#
# Решение:
from random import randint
n = int(input("Введите количество элементов в массиве -> "))
x = int(input("Введите число, которое необходимо найти в массиве -> "))
list_1 = []
count = 0
for i in range(n):
    list_1.append(randint(0,9))
    if list_1[i] == x:
        count = count + 1
print(list_1)
print("Число", x, "встречается в нашем массиве", count, "раз")